Revit 2026 API
SiteSubRegion.Create Method
Overload List
Name | Description
Create(Document, IList<CurveLoop>) | Obsolete.
Create(Document, IList<CurveLoop>, ElementId) | Obsolete.
Top
See Also
Reference
SiteSubRegion Class
Autodesk.Revit.DB.Architecture Namespace